Repository: rustcc/rust-zh
Catalog: rust-zh-translating/omegat/project_save.tmx
Source language: en_us
Languages: zh

source: # Hello, Cargo!
zh: # 你好，Cargo！

source: # Installing Rust
zh: # 安装 Rust

source: # Tools
zh: # 工具

source: % A 30-minute Introduction to Rust
zh: % 30分钟认识Rust语言

source: % The Rust Guide
zh: % Rust入门教程

source: (If you're concerned about `curl | sudo sh`, please keep reading.
zh: （如果你担心`curl | sudo sh`，请继续往前看。

source: (Rust's tooling does [play nice with external libraries written in those tools](http://crates.io/native-build.html), if you need to.)
zh: （但是如果需要，Rust的工具可以跟他们[和平相处](http://crates.io/native-build.html)。）

source: > TOML aims to be a minimal configuration file format that's easy to read due > to obvious semantics.
zh: > TOML 的目标是成为一个语义直观、易于阅读的最小化配置文件格式。

source: > TOML should be easy to parse into data structures in a wide variety of > languages.
zh: > TOML应当很容易被各种语言解析成为它们自己的数据结构。

source: A place for everything, and everything in its place.
zh: 所有文件都在项目根目录内，分门别类存放在不同的位置。

source: Again, we'll discuss the exact details of all of this syntax soon.
zh: 后面再讲具体的语法细节。

source: And printing information to the screen is a pretty common thing to do.
zh: 而且，打印文本信息到屏幕上是再正常不过的事情了。

source: And they should be!
zh: 有这种担心是正常的。

source: And we promise that this method will not be the way to install Rust forever: it's just the easiest way to keep people updated while Rust is in its alpha state.
zh: 我们承诺这种脚本安装方式不会永远持续下去：它仅仅是目前Alpha 阶段最简单的升级方式而已。

source: Anyway, there are two **table**s in this file: `package` and `bin`.
zh: 好吧，上面编辑的Cargo.toml文件里有两个表（table）：`package` 和 `bin`。

source: At first, your program doesn't have any dependencies, so we'll only be using the first part of its functionality.
zh: 最开始的时候，你的程序可能不需要什么依赖，所以我们暂时只用到第一个功能。

source: Bam!
zh: 耶！

source: Basically, when you do this, you are trusting that the good people who maintain Rust aren't going to hack your computer and do bad things.
zh: 因为按照上面那样安装，就得首先信任下载下来的脚本是无害的，信任 Rust 维护者不会入侵你的电脑做坏事。

source: Because this is about high-level concepts, you don't need to actually install Rust to follow along.
zh: 本文仅介绍高层概念，不涉及具体的编程细节，因而你甚至不需要安装Rust。

source: Because we only specified a repository without a version, if someone else were to try out our project at a later date, when `semver` was updated, they would get a different, possibly incompatible version.
zh: 因为我们没有指定外部库的版本号（意味着总是采用其最新版），一旦该库被作者升级（且不兼容旧版），我们的项目将受到影响。

source: But these are the ones most likely to work, as they have the most testing.
zh: Rust在上述三大平台工作的最好，因为测试最充分。

source: Cargo expects your source files to live inside a `src` directory.
zh: Cargo 期望源文件放在 `src` 目录下。

source: Cargo generated a 'hello world' for us.
zh: Cargo自动生成了这句输出“hello world”的代码。

source: Cargo helps us keep our projects nice and tidy.
zh: Cargo帮助我们保持项目结构整洁美观。

source: Cargo is currently in an alpha state, just like Rust, and so it is still a work in progress.
zh: 跟 Rust 一样，Cargo 目前处于 alpha 阶段，也就是正在进行中的项目。

source: Cargo manages three things: building your code, downloading the dependencies your code needs, and building the dependencies your code needs.
zh: Cargo 管理三件事情：构建代码、下载依赖、构建依赖。

source: Click that link, and you'll be chatting with other Rustaceans (a silly nickname we call ourselves), and we can help you out.
zh: 点击链接，您就可以跟Rust亲们（Rustaceans）在线交谈，并寻求帮助。

source: Congrats!
zh: 恭喜。

source: Congratulations!
zh: 恭喜！

source: Consult the documentation for your shell for more details.
zh: 自己去查询终端相关文档吧。

source: Disclaimer below.)
zh: 后面会解释）

source: Don't be scared of using macros.
zh: 别怕使用Rust宏。

source: Each and every commit is tested against Windows just like any other platform.
zh: 每一项新功能或改动都针对 Windows 做过测试，当然也在其他主要平台做过测试。

source: Easy enough!
zh: 非常简单。

source: Enough about tools, let's talk code!
zh: 有关工具方面内容，告一段落，下面讲代码！

source: Even though our program is simple, it's using much of the real tooling that you'll use for the rest of your Rust career.
zh: 这个程序很简单，但用上Cargo这样真实可用的构建工具，为我们以后的 Rust 生涯打好基础。

source: Eventually, we'll add more.
zh: 往后程序会引入其他依赖。

source: Everything is a tradeoff in language design, and Rust has made its choice.
zh: 在语言设计层面，所有东西都需要权衡，Rust 做了它自己的选择。

source: Finally, we'll talk about how Rust breaks down the perceived dichotomy between speed and safety.
zh: 最后，谈谈Rust怎样同时到高效和安全。

source: Finally, a comment about Windows.
zh: 最后，补充一点关于 Windows 的说明。

source: Finally, actually **compiling** and **running** our program.
zh: 最后，编译并运行我们写的代码。

source: Finally, the line ends with a semicolon (`;`).
zh: 接下来看到，这一行，以分号 `;` 结尾。

source: First, let's check out `Cargo.toml`:
zh: 先看看`Cargo.toml`文件的内容：

source: For now, let's compile and run it:
zh: 再次编译和运行：

source: For our purposes, we don't need to worry about this difference.
zh: 就我们目前来看，我们没必要关心它们的不同。

source: Getting started on a new Rust project is incredibly easy, thanks to Rust's package manager, [Cargo](http://crates.io).
zh: 因为有 [Cargo](http://crates.io)，Rust的包管理器（package manager），我们可以很容易的创建新的Rust项目。

source: Here's what's in `src/main.rs`:
zh: 再来看看`src/main.rs`文件内容：

source: Hey there!
zh: 嗨！

source: However, it is already good enough to use for many Rust projects, and so it is assumed that Rust projects will use Cargo from the beginning.
zh: 然而，对很多 Rust 项目来说，它已经足够好了，所以我们从一开始就使用 Cargo 来管理我们的项目。

source: I like to make a `projects` directory in my home directory, and keep all my projects there.
zh: 我喜欢在用户主目录（Home目录）下创建一个目录`projects`，来存放我的所有工程文件。

source: I'm going to use the syntax `editor filename` to represent editing a file in these examples, but you should use whatever method you want.
zh: 我会使用 `editor filename` 这个语法来表示编辑一个文件，但你可以使用任何你喜欢的方法做的。

source: If anything does not work, it is a bug.
zh: 如果您遇到BUG，

source: If it were a function instead, it would look like this: `println()`.
zh: 如果这里是一个函数，看起来就会是：`println()`。

source: If not, there are a number of places where you can get help.
zh: 如果没看到，您可以在下面这些地方寻求帮助：

source: If you come from a dynamically typed language like Ruby, Python, or JavaScript, you may not be used to these two steps being separate.
zh: 如果你来自动态语言（如 Ruby, Python 或 JavaScript）社区，你可能不习惯编译和执行两部分开。

source: If you decide you don't want Rust anymore, we'll be a bit sad, but that's okay.
zh: 如果你不想要 Rust 了，也是可以的（虽然对我们来说有点沮丧）。

source: If you did, Rust has been installed successfully!
zh: 如果您看到了，说明Rust已经安装成功。

source: If you give someone a `.rb` or `.py` or `.js` file, they need to have Ruby/Python/JavaScript installed, but you just need one command to both compile and run your program.
zh: 如果你给别人一个 `.rb` 、 `.py` 或 `.js` 文件，他需要事先安装 Ruby/Python/Javascript 才能运行（但也只需要一个命令即可编译运行）。

source: If you installed Rust some other way, you may want to [check the Cargo README](https://github.com/rust-lang/cargo#installing-cargo-from-nightlies) for specific instructions about installing it.
zh: 如果你是用其它方式安装的 Rust，可以按照 [安装Cargo每日构建版](https://github.com/rust-lang/cargo#installing-cargo-from-nightlies) 中的说明进行安装。

source: If you used the Windows installer, just re-run the `.exe` and it will give you an uninstall option.
zh: 如果你使用的是 Windows ，只需要重新运行 `.exe` 文件，它会给你一个卸载选项。

source: If you'd like to anyway, check out [the homepage](http://rust-lang.org) for explanation.
zh: 其他内容可参考[Rust官方网站](http://rust-lang.org)。

source: If you're on Linux or a Mac, all you need to do is this (note that you don't need to type in the `$`s, they just indicate the start of each command):
zh: 如果你使用 Linux 或 Mac，你需要做的仅仅是（注意，你不需要输入`$`符号，它标识一个命令行的开始）：

source: If you're on Windows and not using PowerShell, the `~` may not work.
zh: 如果你使用 Windows，又没有使用 PowerShell 的话，`~` 可能不起作用。

source: If you're on Windows, please download either the [32-bit installer](https://static.rust-lang.org/dist/rust-nightly-i686-w64-mingw32.exe) or the [64-bit installer](https://static.rust-lang.org/dist/rust-nightly-x86_64-w64-mingw32.exe) and run it.
zh: 如果你使用Windows，可以下载[32-bit installer](https://static.rust-lang.org/dist/rust-nightly-i686-w64-mingw32.exe) 或 [64-bit installer](https://static.rust-lang.org/dist/rust-nightly-x86_64-w64-mingw32.exe) 并运行。

source: If you're one of those people, please check out the documentation on [building Rust from Source](https://github.com/rust-lang/rust#building-from-source), or [the official binary downloads](http://www.rust-lang.org/install.html).
zh: 对于有这种疑虑的人，可以 [从源码构建 Rust](https://github.com/rust-lang/rust#building-from-source) ，或者直接下载 [官方二进制包](http://www.rust-lang.org/install.html) 安装。

source: If you're using more than one word in your file name, use an underscore.
zh: 如果你使用多个单词为您的文件命名，可使用下划线分隔。

source: If you've got Rust installed, you can open up a shell, and type this:
zh: 你已经装上 Rust 了，现在你可以打开一个终端，输入：

source: It accomplishes these goals by being memory safe without using garbage collection.
zh: 它不使用垃圾收集器（GC），同时做到了内存安全。

source: It does not require prior experience with systems programming, but you may find the syntax easier if you've used a 'curly brace' programming language before, like C or JavaScript.
zh: 阅读本文不需要您有系统级编程的经验，但如果您曾经用过C或JavaScript之类编程语言，将更有利于接受Rust的类似语法。

source: It is also considered good style to put the opening curly brace on the same line as the function declaration, with one space in between.
zh: 而且建议将 `{` 放在与函数声明同一行，`{` 前面放一个空格。

source: It's traditional to make your first program in any new language one that prints the text "Hello, world!" to the screen.
zh: 打印文字“Hello, world!”到屏幕上，是学习一门新语言的传统。

source: Just know that sometimes, you'll see a `!`, and that means that you're calling a macro instead of a normal function.
zh: 只需知道，当你看到`!`时，意味着你在使用一个宏，而不是一个函数。

source: Just pass an argument to the script:
zh: 只需要传一个参数给脚本：

source: Just using `rustc` is nice for simple things, but as your project grows, you'll want something to help you manage all of the options that it has, and to make it easy to share your code with other people and projects.
zh: 对写小程序来说，只使用 `rustc` 就够了。但当你的工程变得越来越大，你会希望有个东西能够帮助管理工程的方方面面，同时也能够将自己的代码方便地分享给他人。

source: Let's do that part first:
zh: 先做第二件事：

source: Let's check out what Cargo has generated for us:
zh: 执行上述命令之后，看看Cargo生成了什么目录和文件：

source: Let's compile and run it:
zh: 让我们编译并运行它：

source: Let's convert Hello World to Cargo.
zh: 现在我们把刚才的 Hello World 转换到Cargo。

source: Let's go over what just happened in detail.
zh: 让我们仔细看看刚才做了什么。

source: Let's go!
zh: 那就开始吧！

source: Let's let it explain itself to you:
zh: 对TOML的简要说明如下：：

source: Let's make a new source file next.
zh: 下面我们创建一个源文件。

source: Luckily for us, the script we ran to install Rust includes Cargo by default.
zh: 幸运的是，用前面脚本安装的 Rust 里面已经默认包含 Cargo 了。

source: Make sure to get this name right: you need the capital `C`!
zh: 请确保文件名正确：第一个字母 `C` 要大写。

source: Most lines of Rust code end with a `;`.
zh: 大多数 Rust 代码都以 `;` 结尾。

source: Next up is this line:
zh: 接着看下面这行：

source: Next, I'd like to introduce you to another tool, Cargo, which is used to write real-world Rust programs.
zh: 下面，我会介绍一个工具，Cargo，它用于编写真正的Rust程序。

source: Next, `"Hello, world!"` is a **string**.
zh: 接下来，`"Hello, world!"` 是一个 **字符串（string）**。

source: Next, our configuration file:
zh: 下一步编辑配置文件：

source: Next, we'll introduce you to a tool that's useful for writing real-world Rust programs and libraries: "Cargo." After that, we'll talk about the basics of Rust, write a little program to try them out, and then learn more advanced things.
zh: 然后，我们会介绍在实际开发中非常有用的工具：Cargo （程序和库皆适用）。然后，我们会谈到 Rust 的基础，用一个小程序来试验。然后再学习一些高级的特性。

source: Not every programming language is great for everyone.
zh: 不是每种编程语言都适合每一个人。

source: Now that you have Rust installed, let's write your first Rust program.
zh: 已经安装好Rust，我们现在开始写第一个 Rust 程序吧。

source: Now that you've got the tools down, let's actually learn more about the Rust language itself.
zh: 既然你会使用这个工具了，那么就让我们开始学习更多 Rust 语言的内容。

source: Now that you've got your file open, type this in:
zh: 然后，打开这个文件，在里面输入：

source: Now, you can pull in that library using `extern crate` in `main.rs`.
zh: 现在可以在`main.rs`文件里使用`semver`库（ `extern crate semver;`）：

source: Oh, we should also mention the officially supported platforms:
zh: 目前，Rust 官方支持如下平台：

source: Once you have this file in place, we should be ready to build!
zh: 准备好这个文件，我们可以开始构建了！

source: One last thing to mention: Rust's macros are significantly different than C macros, if you've used those.
zh: 最后一件事情要注意的是： Rust 的宏与 C 语言的宏明显不同。

source: Or on Windows:
zh: Windows系统下这样查看：

source: Other great resources include [our mailing list](https://mail.mozilla.org/listinfo/rust-dev), [the /r/rust subreddit](http://www.reddit.com/r/rust), and [Stack Overflow](http://stackoverflow.com/questions/tagged/rust).
zh: 其他有用的资源还包括 [rust-dev邮件组](https://mail.mozilla.org/listinfo/rust-dev)、[Reddit的/r/rust频道](http://www.reddit.com/r/rust)，以及[Stack Overflow](http://stackoverflow.com/questions/tagged/rust)。

source: Please configure your editor of choice to insert four spaces with the tab key.
zh: 请配置您的编辑器，按下Tab键时自动输入4个空格。

source: Please let us know if that happens.
zh: 请报告给我们。

source: Put this inside:
zh: 加入如下内容：

source: Right now, we don't have any, so it's a bit sparse.
zh: 目前，我们并没有什么依赖，所以内容很少。

source: Rust will output a binary executable.
zh: Rust编译器将生成一个二进制可执行文件。

source: Rust considers Windows to be a first-class platform upon release, but if we're honest, the Windows experience isn't as integrated as the Linux/OS X experience is.
zh: 我们视 Windows 为第一级发布平台，但老实说，Rust 的 Windows 体验没有做到像 Linux/OS X 那样好。

source: Rust does not require that you know a whole ton about the command line, but until the language is in a more finished state, IDE support is spotty.
zh: Rust也不要求您懂很多命令行操作，但是在语言还没有正式发布之前，IDE支持度有限。

source: Rust does not care where your code lives.
zh: Rust并不介意您把代码放在哪里。

source: Rust files always end in a `.rs` extension.
zh: Rust 源文件扩展名固定是 `.rs`。

source: Rust implements `println!` as a macro rather than a function for good reasons, but that's a very advanced topic.
zh: Rust 将`println!`实现成一个宏（而不是一个函数），是有一些原因的，但涉比较高级的话题。

source: Rust is a modern systems programming language focusing on safety and speed.
zh: Rust是一个先进的系统级编程语言，专注于安全和速度。

source: Rust is a systems programming language with a focus on "high-level, bare-metal programming": the lowest level control a programming language can give you, but with zero-cost, higher level abstractions, because people aren't computers.
zh: Rust 是一个关注于“高阶-裸机”的系统级编程语言——将对机器的低阶控制与对世界的高阶抽象结合在一起（人不是计算机，高级语言的作用即充当人与机器之间的翻译）。

source: Rust is an **ahead-of-time compiled language**, which means that you can compile a program, give it to someone else, and they don't need to have Rust installed.
zh: Rust 是一个编译型语言，意味着你可以编译生成一个可执行程序，把它分发给其他人，他们不需要安装 Rust就能运行。

source: Rust is an **expression oriented** language, which means that most things are expressions.
zh: Rust 是一个 **面向表达式** 的语言，这意味着 Rust 中大多数东西都是表达式。

source: Rust is still pre-1.0, and so people assume that you're using a very recent Rust.
zh: Rust 还没有发布 1.0 正式版，大家讨论问题一般都是基于最新版，所以你最好也升级到最新版。

source: Rust makes no specific demands on your editing tooling, or where your code lives.
zh: Rust对您的编辑器和代码存在哪个目录没有特殊要求。

source: Rust requires these around all function bodies.
zh: Rust 要求如此。

source: Save the file, and then type this into your terminal window:
zh: 保存文件，并在终端里面输入：

source: Since we started off by using Cargo, it'll be easy to add later.
zh: 因为我们一开始就使用 Cargo，后面添加新的依赖也非常容易。

source: Sound good?
zh: 听起来很有趣？

source: Strings are a surprisingly complicated topic in a systems programming language, and this is a **statically allocated** string.
zh: 字符串在系统级编程语言中是相当复杂的话题，这里的字符串是 **静态分配（statically allocated）** 的。

source: Success!
zh: 成功！

source: TOML is designed to map unambiguously to a hash table.
zh: 它被设计为能够明确无歧义地映射到哈希表结构。

source: TOML is very similar to INI, but with some extra goodies.
zh: TOML非常像 INI 格式，但多了一些好处。

source: That leaves the top level for other things, like READMEs, license information, and anything not related to your code.
zh: 留出上层目录放给其它文件，比如README、版权信息等与源代码无关的文件。

source: That makes you a Rust programmer!
zh: 你已经变成一个 Rust 程序员咯！

source: That's a good instinct!
zh: 这是一种本能的自我保护。

source: That's it!
zh: 好了。

source: The `;` is used to indicate that this expression is over, and the next one is ready to begin.
zh: 分号 `;` 用于标识当前表达式结束，新的表达式准备开始。

source: The `main` function is special: it's the beginning of every Rust program.
zh: 这个`main`函数比较特殊：它是每个 Rust 程序的开始（入口函数）。

source: The concepts are more important than the syntax, so don't worry if you don't get every last detail: you can read [the Guide](guide.html) to get a more complete explanation.
zh: 概念比语法更重要，先不要拘泥于语法，必要时再去阅读[入门手册](guide.md)获得详细解释。

source: The easiest is [the #rust IRC channel on irc.mozilla.org](irc://irc.mozilla.org/#rust), which you can access through [Mibbit](http://chat.mibbit.com/?server=irc.mozilla.org&channel=%23rust).
zh: 最简单的是 [the #rust IRC channel on irc.mozilla.org](irc://irc.mozilla.org/#rust)，通过[Mibbit](http://chat.mibbit.com/?server=irc.mozilla.org&channel=%23rust)；

source: The first tells Cargo metadata about your package.
zh: 第一个告诉 Cargo 这个包（package）的元信息。

source: The first is that it's indented with four spaces, not tabs.
zh: 第一点是这一行用4个空格缩进，而不是一个Tab。

source: The first line says "I'm declaring a function named `main`, which takes no arguments and returns nothing." If there were arguments, they would go inside the parentheses (`(` and `)`), and because we aren't returning anything from this function, we've dropped that notation entirely.
zh: 第一行意思是“我声明了一个函数，名叫`main`，它没有参数，也不返回任何值”。 如果存在参数，就放在小括号 `(` 和 `)` 之间。在这个例子中，我们不准备返回什么东西，所以先不讲。

source: The first step to using Rust is to install it!
zh: 使用 Rust 的第一步当然是安装！

source: The first thing that we need to do is make a file to put our code in.
zh: 首先我们得建一个文件来放我们的代码。

source: The first thing we need to do to begin using Cargo is to install Cargo.
zh: 第一件事情就是安装 Cargo。

source: The nice thing about starting with such a simple program is that you can verify that your compiler isn't just installed, but also working properly.
zh: 其作用在于让你确信编译器工作正常，而不仅仅是安装好了。

source: The second point is the `println!()` part.
zh: 第二点是`println!()`。

source: The second tells Cargo that we're interested in building a binary, not a library (though we could do both!), as well as what it is named.
zh: 第二个告诉 Cargo 我们要构建一个可执行文件，而不是一个库（其实我们都可以做到）。

source: Then, we'll talk about Rust's most interesting feature, **ownership**, and then discuss how it makes concurrency easier to reason about.
zh: 然后讲Rust最有趣的特性，**所有权（ownership）**，然后讲怎样方便的使用并发（concurrency）。

source: There are a number of details that are important here.
zh: 这里有好几个需要重点注意的地方。

source: There are a number of ways to install Rust, but the easiest is to use the `rustup` script.
zh: 有很多种方式可以安装 Rust，最简单的是使用`rustup`脚本。

source: There are now two files: our source code, with the `.rs` extension, and the executable (`main.exe` on Windows, `main` everywhere else)
zh: 有两个文件：以 `.rs` 扩展名结尾的源代码文件；可执行文件 （在 Windows 中是 `main.exe`，在其它平台中是 `main`）。

source: There is a lot more here, and this is a whirlwind tour, but you should feel right at home if you've used tools like [Bundler](http://bundler.io/), [npm](https://www.npmjs.org/), or [pip](https://pip.pypa.io/en/latest/).
zh: 还有很多内容，这里就不讲了。这只是一个简短的教材。如果您曾经用过[Bundler](http://bundler.io/)、 [npm](https://www.npmjs.org/)或[pip](https://pip.pypa.io/en/latest/)，会发现Cargo跟他们相似。

source: There's no `Makefile`s or endless `autotools` output here.
zh: 这里没有`Makefile`和`autotools`。

source: These are the basics that will serve you well through the rest of your time with Rust.
zh: 这些基础知识将有助于你今后学习和应用Rust语言。

source: These lines define a **function** in Rust.
zh: 这几句Rust代码定义了一个 **函数（function）**。

source: This actually leads to one other concern we should address: this guide will assume that you have basic familiarity with the command line.
zh: 本教程假设你熟悉一些基本的命令行操作。

source: This brings me to one other point: some people, and somewhat rightfully so, get very upset when we tell you to `curl | sudo sh`.
zh: 有些朋友听说安装 Rust 需要使用 `curl | sudo sh`，会有抵触情绪。

source: This file is in the [TOML](https://github.com/toml-lang/toml) format.
zh: 这个文件用的是 [TOML](https://github.com/toml-lang/toml) 格式。

source: This file is used by Cargo to keep track of dependencies in your application.
zh: 这个文件被 Cargo 用来跟踪依赖关系。

source: This gives us repeatable builds.
zh: 以后编译时都固定采用此版本号，不受它们升级的影响。

source: This hasn't bought us a whole lot over our simple use of `rustc`, but think about the future: when our project has more than one file, we would need to call `rustc` twice, and pass it a bunch of options to tell it to build everything together.
zh: 对这个例子而言，相比使用 `rustc`，并没有给我们带来额外的好处，但我们要为未来考虑：当项目有多个文件的时候，需要运行 `rustc` 两次，并给它传一堆参数，告诉它把所有东西构建到一起。

source: This introduction will give you a rough idea of what Rust is like, eliding many details.
zh: 本文将向您粗略的介绍Rust是什么。

source: This is all we need to get started.
zh: 就是这些。

source: This is called a **manifest**, and it contains all of the metadata that Cargo needs to compile your project.
zh: `Cargo.toml`被称为**清单（manifest）**，它包含了编译此项目所需的所有元数据（metadata）。

source: This is calling a Rust **macro**, which is how metaprogramming is done in Rust.
zh: 它是一个 Rust **宏（Macro）**，用于支持Rust元编程（Metaprogramming）。

source: This is similar to `gcc` or `clang`, if you come from a C or C++ background.
zh: 如果你有 C 或 C++ 背景，你会发现这个类似 `gcc` 或 `clang`。

source: This is the place to be if you'd like to learn how to program in Rust.
zh: 如果你想学习如何使用 Rust 编程，那算是来对地方了。

source: This line does all of the work in our little program.
zh: 这一行是程序主体部分。

source: This prints out our `Hello, world!` text to our terminal.
zh: 运行这个可执行文件，就打印出 `Hello, world!` 到终端里面来了。

source: To Cargo-ify our project, we need to do two things: Make a `Cargo.toml` configuration file, and put our source file in the right place.
zh: 为了把现有的项目Cargo化，需要做两件事：创建 `Cargo.toml` 配置文件，然后把源代码文件放到合适的位置。

source: To show off Rust, let's talk about how easy it is to get started with Rust.
zh: 我们先讲，开始使用Rust是很容易的。

source: To show you how to get going with Rust, we're going to write the traditional "Hello, World!" program.
zh: 为了展示如何开始使用 Rust，我们还是用最经典的 "Hello, World!" 做例子。

source: To solve this problem, Cargo produces a file, `Cargo.lock`, which records the versions of any dependencies.
zh: 为了解决此问题，Cargo自动生成文件`Cargo.lock`，里面保存了本项目中所有依赖库的版本号。

source: To start a new project with Cargo, use `cargo new`:
zh: 要创建新项目，执行命令 `cargo new`：

source: Try this:
zh: 尝试执行以下命令：

source: Using an external dependency in Rust is incredibly easy.
zh: 引用外部依赖项对Cargo来说是小菜一碟。

source: We build our project with `cargo build`, and run it with `./target/hello_world`.
zh: 我们使用 `cargo build` 构建项目，用 `./target/hello_world` 来执行它。

source: We can compile with our compiler, `rustc`, by passing it the name of our source file:
zh: 按如下方式编译，把源代码文件名当作参数传递给编译器`rustc`：

source: We extensively test Rust on these platforms, and a few others, too, like Android.
zh: 我们在上述平台上充分测试过 Rust。在其他少数平台也做过一些测试，比如Android。

source: We pass this string as an argument to `println!`, which prints the string to the screen.
zh: 我们把这个字符串作为参数传递给 `println!`，它把这个串打印到屏幕上。

source: We provide some [sample configurations for various editors](https://github.com/rust-lang/rust/tree/master/src/etc).
zh: 我们提供了一些配置示例：[各种编辑器的配置](https://github.com/rust-lang/rust/tree/master/src/etc)。

source: We really think Rust is something special, and we hope you do too.
zh: 我们认为 Rust 真的很特别，在看完本教程之后，希望你也如此。

source: We will cover this in-depth later in the guide.
zh: 后面我们还会深入了解。

source: We will talk more about different kinds of allocation later.
zh: 后面我们还会谈到不同种类的内存分配。

source: We'll call our file `main.rs`:
zh: 我们创建的文件叫 `main.rs`：

source: We'll get to it later.
zh: 后面再讲关于返回值的内容。

source: We'll get to the details eventually, you'll just have to trust us for now.
zh: 后面我们会深入了解的，现在你只要相信我们说的就行了。

source: We'll talk more about the syntax here later, but that's what Rust code looks like!
zh: Rust源代码就是这个样子，后面还会讲到语法部分。

source: We're passing `--bin` because we're making a binary program: if we were making a library, we'd leave it off.
zh: 这里传入参数`--bin`，是因为我们要创建一个可执行项目；如果要创建一个库，就不需要这个参数了。
